const MAX_DATA_ELEMENTS = 25;

const likesRange = {
  MIN: 15,
  MAX: 200,
};

const avatarsRange = {
  MIN: 1,
  MAX: 6,
};

const commentsRange = {
  MIN: 0,
  MAX: 30,
};

const userNames = [
  'Артём', 'Анна', 'Михаил', 'Екатерина', 'Сергей', 'Ольга', 'Дмитрий', 'Наталья', 'Алексей', 'Мария'
];

const userMessages = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!'
];

export {
  MAX_DATA_ELEMENTS,
  likesRange,
  avatarsRange,
  commentsRange,
  userNames,
  userMessages,
};
